ninenine_cats/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "color", "name", "description", "sex", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @cat = Cat.new(cat_params)
    if @cat.save